// src/api/movie.ts

import express, { Request, Response, Router } from "express";
// express 모듈에서 express, (request, response, router)-> 타입 정의를 위해 불러옴!

const router: Router = express.Router();

router.get("/", (req: Request, res: Response) => {
  const movie ={
    title: 'I am Sam',
    content: '지적 장애로 7살의 지능밖에 갖지 못한 샘(숀 팬)은 버스정류장 옆 커피 전문점에서 일한다. 그날, 황망하게 가게를 나온 샘은 병원으로 향하고, 레베카와의 사이에서 태어난 자신의 딸과 첫 대면을 하게 된다. 그러나 병원을 나서자 레베카는 샘과 딸을 두고 사라져버린다. 혼자 남겨진 샘은 좋아하는 가수 비틀즈의 노래에서 따온 루시 다이아몬드를 딸의 이름으로 짓고 둘만의 생활을 시작한다. 그러나 외출공포증으로 집안에서 피아노만 연주하는 이웃집 애니(다이앤 위스트)와 샘과 같은 장애를 갖고 있으면서도 언제나 밝은 친구 이프티와 로버트 같은 주변의 따뜻하고 친절한 도움이 없었다면 루시(다코타 패닝)가 그렇게 건강하고 밝게 자라기 힘들었을 것. 수요일에는 레스토랑에, 목요일에는 비디오 나이트에, 금요일에는 노래방에 함께 다니는 것이 이들 부녀의 작은 행복. 남들이 보기에는 정상적이지 못하지만 그들은 가장 즐거운 시간을 함께 하며 행복한 가정을 이루고 있다. 그런데 루시가 7살이 되면서 아빠의 지능을 추월해버리는 것을 두려워한 나머지 학교 수업을 일부러 게을리하게 되고, 이로 인해 사회복지기관에서 샘의 가정을 방문한다. 그리고 샘은 아빠로서 양육 능력이 없다는 선고를 받게 된다. 결국 루시는 시설로 옮겨지고, 샘은 주 2회의 면회만을 허락받게 된다. 세상에서 가장 사랑하는 딸과의 행복한 날들을 빼앗기고 실의에 빠진 샘. 그는 법정에서 싸워 루시를 되찾을 결심을 굳히고, 승승장구하는 엘리트 변호사 리타 해리슨(미셸 파이퍼)의 사무실을 찾아간다. 정력적이고 자아 도취적인 변호사 리타는 동료들에게 자신의 능력을 과시하기 위해 무료로 샘의 변호를 맡겠다고 공언하고 샘과의 도저히 어울리지 않을 것 같은 연대를 맺게 된다. 그러나 아무리 생각해도 샘에게는 불리한 재판으로 그가 양육권을 인정받을 가능성은 낮았다. 샘이 훌륭한 아빠라는 것을 인정해줄 친구들은 재판에서는 증언조차 불가능하다. 음악 대학을 수석졸업, 유일하게 법정에 설 수 있는 애니 역시 어렵게 외출 공포증을 극복하고 증언대에 서지만, 상대 변호사의 추궁을 받으면서 답변을 하지 못하게 된다. 과연 샘은 루시의 훌륭한 아빠라는 것을 증명할 수 있을까...?'
  }
  return res.status(200).json({
    status: 200,
    message: "영화 조회 성공",
    data: movie,
  });
});

module.exports = router;